stressTest.yml
config:
  target: 'http://ec2-18-223-151-174.us-east-2.compute.amazonaws.com:1234'
  processor: './stressTestHelper.js'
  phases:
    - duration: 60
      arrivalRate: 1000
    - duration: 60
      arrivalRate: 100
    - duration: 60
      arrivalRate: 10
    - duration: 60
      arrivalRate: 1
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  # - name: 'GET listingInfo'
  #   flow:
  #   - function: 'artilleryContext'
  #   - get:
  #       url: "/listing/{{ id }}"

  - name: 'PUT listingInfo'
    flow:
      - function: 'artilleryContext'
      - put:
          url: '/store/review'
          json:
            id: "{{ id }}"
            storeId: "{{ storeId }}"
            userId: "{{ userId }}"
            text: "{{ text }}"
            starRating: "{{ starRating }}"